minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  //Set the host name
  char bufPrefix[] = "SHOLAT_";
  char bufChipId[11];
  itoa(ESP.getChipId(), bufChipId, 10);

  //char bufHostName[32];
  strlcpy(_config.hostname, bufPrefix, sizeof(_config.hostname));
  strncat(_config.hostname, bufChipId, sizeof(bufChipId));

  //  loadHTTPAuth();

  // _configAP.APenable = true;

  // WiFi.persistent(true);
  // WiFi.mode(WIFI_OFF);

  // bool autoConnect = false;
  // WiFi.setAutoConnect(autoConnect);

  // bool autoReconnect = true;
  // WiFi.setAutoReconnect(autoReconnect);

  WiFi.hostname(_config.hostname);

  WiFi.mode(WIFI_OFF);

  WiFi.setAutoConnect(autoConnect);
  WiFi.setAutoReconnect(autoReconnect);

  if (_configAP.APenable || strcmp(_config.ssid, "") == 0)
  {
    PRINT("Starting wifi in WIFI_AP mode.\r\n");
    // WiFi.mode(WIFI_OFF);
    // WiFi.mode(WIFI_AP); // bikin error
    WiFi.softAP(_configAP.ssid, _configAP.password);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
  }
  else if (!_configAP.APenable)
  {
    if (!_config.dhcp)
    {
      PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
      // WiFi.mode(WIFI_OFF);
      // WiFi.mode(WIFI_STA);

      IPAddress static_ip;
      IPAddress gateway;
      IPAddress netmask;
      IPAddress dns0;
      IPAddress dns1;

      static_ip.fromString(_config.static_ip);
      gateway.fromString(_config.gateway);
      netmask.fromString(_config.netmask);
      dns0.fromString(_config.dns0);
      dns1.fromString(_config.dns1);

      WiFi.config(static_ip, gateway, netmask, dns0, dns1);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      // WiFi.waitForConnectResult();
    }
    else
    {
      PRINT("Starting wifi in WIFI_STA mode.\r\n");
      // WiFi.mode(WIFI_OFF);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      // WiFi.waitForConnectResult();
    }
  }

  dnsServer.start(53, "*", WiFi.softAPIP());

  // MDNS.addService("http", "tcp", 80);

  ArduinoOTA.setHostname(_config.hostname);
  ArduinoOTA.begin();

  NBNS.begin(_config.hostname);

  DEBUGLOG("Starting SSDP...\r\n");
  SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  SSDP.setHTTPPort(80);
  SSDP.setDeviceType(FPSTR(pgm_upnprootdevice));
  //  SSDP.setModelName(_config.deviceName.c_str());
  //  SSDP.setModelNumber(FPSTR(modelNumber));
  SSDP.begin();

  // // SSDP.setSchemaURL("description.xml");
  // SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  // SSDP.setHTTPPort(80);
  // SSDP.setName("Philips hue clone");
  // SSDP.setSerialNumber("001788102201");
  // SSDP.setURL("index.html");
  // SSDP.setModelName("Philips hue bridge 2012");
  // SSDP.setModelNumber("929000226503");
  // SSDP.setModelURL("http://www.meethue.com");
  // SSDP.setManufacturer("Royal Philips Electronics");
  // SSDP.setManufacturerURL("http://www.philips.com");
  // SSDP.begin();

  //SPIFFS.begin();

  server.addHandler(new SPIFFSEditor());

  server.on("/list", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
    handleFileList(request);
  });

  // server.on("/description.xml", [](AsyncWebServerRequest *request) {
  //   DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);
  //   // SSDP.schema(HTTP.client());
  // });

  server.on("/description.xml", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

    File file = SPIFFS.open(FPSTR(pgm_descriptionxmlfile), "r");
    if (!file)
    {
      PRINT("Failed to open %s file\r\n", file.name());
      file.close();
      return;
    }

    size_t size = file.size();
    DEBUGLOG("%s file size: %d bytes\r\n", file.name(), size);

    size_t allocatedSize = 1024;
    if (size > allocatedSize)
    {
      PRINT("WARNING, %s file size %d bytes is larger than allocatedSize %d bytes. Exiting...\r\n", file.name(), size, allocatedSize);
      file.close();
      return;
    }

    // Allocate a buffer to store contents of the file
    char buf[size + 1];

    //copy file to buffer
    file.readBytes(buf, size);

    //add termination character at the end
    buf[size] = '\0';

    //close the file, save your memory, keep healthy :-)
    // file.close();

    DEBUGLOG("%s\r\n", buf);

    StreamString output;

    if (output.reserve(allocatedSize))
    {
      //convert IP address to char array
      size_t len = strlen(WiFi.localIP().toString().c_str());
      char URLBase[len + 1];
      strlcpy(URLBase, WiFi.localIP().toString().c_str(), sizeof(URLBase));

      // const char *friendlyName = WiFi.hostname().toString().c_str();
      len = strlen(WiFi.hostname().c_str());
      char friendlyName[len + 1];
      strlcpy(friendlyName, WiFi.hostname().c_str(), sizeof(friendlyName));

      char presentationURL[] = "/";
      uint32_t serialNumber = ESP.getChipId();
      char modelName[] = "LS-01";
      const char *modelNumber = friendlyName;
      //output.printf(ssdpTemplate,
      output.printf(buf,
                    URLBase,
                    friendlyName,
                    presentationURL,
                    serialNumber,
                    modelName,
                    modelNumber, //modelNumber
                    (uint8_t)((serialNumber >> 16) & 0xff),
                    (uint8_t)((serialNumber >> 8) & 0xff),
                    (uint8_t)serialNumber & 0xff);
      request->send(200, "text/xml", output);
    }
    else
    {
      request->send(500);
    }
  });

  // SSDP.schema(HTTP.client());

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

  server.onNotFound([](AsyncWebServerRequest *request) {
    DEBUGLOG("NOT_FOUND: ");
    if (request->method() == HTTP_GET)
    {
      DEBUGLOG("GET");
    }
    else if (request->method() == HTTP_POST)
    {
      DEBUGLOG("POST");
    }
    else if (request->method() == HTTP_DELETE)
    {
      DEBUGLOG("DELETE");
    }
    else if (request->method() == HTTP_PUT)
    {
      DEBUGLOG("PUT");
    }
    else if (request->method() == HTTP_PATCH)
    {
      DEBUGLOG("PATCH");
    }
    else if (request->method() == HTTP_HEAD)
    {
      DEBUGLOG("HEAD");
    }
    else if (request->method() == HTTP_OPTIONS)
    {
      DEBUGLOG("OPTIONS");
    }
    else
    {
      DEBUGLOG("UNKNOWN");
    }
    DEBUGLOG(" http://%s%s\r\n", request->host().c_str(), request->url().c_str());

    if (request->contentLength())
    {
      DEBUGLOG("_CONTENT_TYPE: %s\r\n", request->contentType().c_str());
      DEBUGLOG("_CONTENT_LENGTH: %u\r\n", request->contentLength());
    }

