minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
    int i;

    int headers = request->headers();
    for (i = 0; i < headers; i++)
    {
      AsyncWebHeader *h = request->getHeader(i);
      DEBUGLOG("_HEADER[%s]: %s\r\n", h->name().c_str(), h->value().c_str());
    }

    int params = request->params();
    for (i = 0; i < params; i++)
    {
      AsyncWebParameter *p = request->getParam(i);
      if (p->isFile())
      {
        DEBUGLOG("_FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
      }
      else if (p->isPost())
      {
        DEBUGLOG("_POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
      else
      {
        DEBUGLOG("_GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
      }
    }

    request->send(404);
  });
  server.onFileUpload([](AsyncWebServerRequest *request, const String &filename, size_t index, uint8_t *data, size_t len, bool final) {
    if (!index)
      DEBUGLOG("UploadStart: %s\r\n", filename.c_str());
    DEBUGLOG("%s", (const char *)data);
    if (final)
      DEBUGLOG("UploadEnd: %s (%u)\r\n", filename.c_str(), index + len);
  });
  server.onRequestBody([](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
    if (!index)
      DEBUGLOG("BodyStart: %u\r\n", total);
    DEBUGLOG("%s", (const char *)data);
    if (index + len == total)
      DEBUGLOG("BodyEnd: %u\r\n", total);
  });

  server.on("/scan", HTTP_GET, [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    DynamicJsonBuffer jsonBuffer;
    JsonArray &root = jsonBuffer.createArray();

    int numberOfNetworks = WiFi.scanComplete();
    if (numberOfNetworks == -2)
    {                          //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
      WiFi.scanNetworks(true); //async enabled
    }
    else if (numberOfNetworks)
    {
      for (int i = 0; i < numberOfNetworks; ++i)
      {
        JsonObject &wifi = root.createNestedObject();
        wifi["ssid"] = WiFi.SSID(i);
        wifi["rssi"] = WiFi.RSSI(i);
        wifi["bssid"] = WiFi.BSSIDstr(i);
        wifi["channel"] = WiFi.channel(i);
        wifi["secure"] = WiFi.encryptionType(i);
        wifi["hidden"] = WiFi.isHidden(i) ? true : false;
      }
      WiFi.scanDelete();
      if (WiFi.scanComplete() == -2)
      { //this may also works: WiFi.scanComplete() == WIFI_SCAN_FAILED
        WiFi.scanNetworks(true);
      }
    }
    root.printTo(*response);
    request->send(response);
  });

  server.on("/admin/restart", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    restart_esp(request);
  });

  server.on("/reset", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    reset_esp(request);
  });

  server.on("/admin/wwwauth", [](AsyncWebServerRequest *request) {
    send_wwwauth_configuration_values_html(request);
  });

  server.on("/system.html", [](AsyncWebServerRequest *request) {
    send_wwwauth_configuration_html(request);
  });

  server.on("/update/updatepossible", [](AsyncWebServerRequest *request) {
    send_update_firmware_values_html(request);
  });

  server.on("/setmd5", [](AsyncWebServerRequest *request) {
    setUpdateMD5(request);
  });

  server.on("/update", HTTP_GET, [](AsyncWebServerRequest *request) {
    request->send(SPIFFS, "/update.html");
  });

  server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {
    const char* responseContent;
    if (Update.hasError())
    {
      responseContent = PSTR("FAIL");
    }
    else
    {
       responseContent = PSTR("<META http-equiv=\"refresh\" content=\"15;URL=/update\">Update correct. Restarting...");
    }
    AsyncWebServerResponse *response = request->beginResponse_P(200, "text/html", responseContent);
    
    response->addHeader("Connection", "close");
    response->addHeader("Access-Control-Allow-Origin", "*");
    request->send(response); },
            [](AsyncWebServerRequest *request, const String filename, size_t index, uint8_t *data, size_t len, bool final) { updateFirmware(request, filename, index, data, len, final); });

  server.on("/admin/connectionstate", [](AsyncWebServerRequest *request) {
    send_connection_state_values_html(request);
  });

  // server.on("/settime.html", [](AsyncWebServerRequest *request) {
  //   set_time_html(request);
  // });

  server.on("/setrtctime", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          if (request->hasParam("timestamp", true))
          {
            const char *data = p->value().c_str();

            char *token = strtok((char *)&data[2], " ");
            uint32_t utcTimestamp = (unsigned long)strtol(token, '\0', 10);

            DEBUGLOG("timestanp received: %u\r\n", utcTimestamp);

            RtcDateTime timeToSetToRTC;
            timeToSetToRTC.InitWithEpoch32Time(utcTimestamp);

            Rtc.SetDateTime(timeToSetToRTC);

            // lastSyncRTC = utcTimestamp;

            lastSync = utcTimestamp;

            //beep
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_settimepage));
  });

  server.on("/config/network", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_network(request);
  });

  server.on("/confignetwork", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

