minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
          if (request->hasParam(FPSTR(pgm_saveconfig), true))
          {
            const char *config = p->value().c_str();

            StaticJsonBuffer<512> jsonBuffer;
            JsonObject &root = jsonBuffer.parseObject(config);

            File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");

            if (!file)
            {
              DEBUGLOG("Failed to open NETWORK config file\r\n");
              file.close();
              return;
            }

            root.prettyPrintTo(file);
            file.flush();
            file.close();

            load_config_network();

            configFileNetworkUpdatedFlag = true;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpagenetwork));
  });

  server.on("/config/location", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_location(request);
  });

  server.on("/configlocation", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          if (request->hasParam(FPSTR(pgm_saveconfig), true))
          {
            const char *config = p->value().c_str();

            StaticJsonBuffer<1024> jsonBuffer;
            JsonObject &root = jsonBuffer.parseObject(config);

            File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "w");

            if (!file)
            {
              DEBUGLOG("Failed to open LOCATION config file\r\n");
              file.close();
              return;
            }

            root.prettyPrintTo(file);
            file.flush();
            file.close();

            configFileLocationUpdated = true;

            //beep
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpagelocation));
  });

  server.on("/config/time", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_time(request);
  });

  server.on("/config/sholat", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_sholat(request);
  });

  server.on("/config/ledmatrix", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_ledmatrix(request);
  });

  server.on("/configledmatrix", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          if (request->hasParam(FPSTR(pgm_saveconfig), true))
          {
            const char *config = p->value().c_str();

            StaticJsonBuffer<1024> jsonBuffer;
            JsonObject &root = jsonBuffer.parseObject(config);

            File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");

            if (!file)
            {
              DEBUGLOG("Failed to open LED MATRIX config file\r\n");
              file.close();
              return;
            }

            root.prettyPrintTo(file);
            file.flush();
            file.close();

            load_config_ledmatrix();

            //beep
            tone1 = HIGH;
          }

          if (request->hasParam(FPSTR(pgm_longtext), true))
          {
            const char *fileName = pgm_RUNNING_TEXT_FILE;

            File file = SPIFFS.open(fileName, "w");

            if (!file)
            {
              DEBUGLOG("Failed to open %s file\r\n", fileName);
              file.close();
              return;
            }

            const char *longtext = p->value().c_str();

            for (uint16_t j = 0; j < strlen(longtext); j++)
            {
              file.write(longtext[j]);
            }

            file.close();
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpageledmatrix));
  });

  server.on("/config/mqtt", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_mqtt(request);
  });

  server.on("/configmqtt", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          //******************************
          // save Mqtt config
          //******************************
          if (request->hasParam(FPSTR(pgm_configpagemqtt), true))
          {
            const char *config = p->value().c_str();

            StaticJsonBuffer<512> jsonBuffer;
            JsonObject &root = jsonBuffer.parseObject(config);

