minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  // //Check if FILE was uploaded
  // if (request->hasParam("download", true, true))
  //   AsyncWebParameter* p = request->getParam("download", true, true);

  //handleFileRead("/setrtctime.html", request);
  request->send(SPIFFS, request->url());
}

bool load_config_location()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "r");
  if (!file)
  {
    DEBUGLOG("Failed to open config LOCATION file\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGLOG("config LOCATION file size: %d bytes\r\n", size);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);
  file.close();

  if (!root.success())
  {
    DEBUGLOG("Failed to parse config LOCATION file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
#endif

  if (root[FPSTR(pgm_province)].success())
  {
    strlcpy(_configLocation.province, root[FPSTR(pgm_province)], sizeof(_configLocation.province));
  }
  if (root[FPSTR(pgm_regency)].success())
  {
    strlcpy(_configLocation.regency, root[FPSTR(pgm_regency)], sizeof(_configLocation.regency));
  }
  if (root[FPSTR(pgm_district)].success())
  {
    strlcpy(_configLocation.district, root[FPSTR(pgm_district)], sizeof(_configLocation.district));
  }
  // if (root[FPSTR(pgm_timezone)].success())
  // {
  //   _configLocation.timezone = root[FPSTR(pgm_timezone)];
  // }
  if (root[FPSTR(pgm_timezonestring)].success())
  {
    strlcpy(_configLocation.timezonestring, root[FPSTR(pgm_timezonestring)], sizeof(_configLocation.timezonestring));
  }
  if (root[FPSTR(pgm_latitude)].success())
  {
    _configLocation.latitude = root[FPSTR(pgm_latitude)];
  }
  if (root[FPSTR(pgm_longitude)].success())
  {
    _configLocation.longitude = root[FPSTR(pgm_longitude)];
  }

  DEBUGLOG("\r\nConfig LOCATION loaded successfully.\r\n");
  DEBUGLOG("province: %s\r\n", _configLocation.province);
  DEBUGLOG("regency: %s\r\n", _configLocation.regency);
  DEBUGLOG("district: %s\r\n", _configLocation.district);
  DEBUGLOG("timezonestring: %s\r\n", _configLocation.timezonestring);
  DEBUGLOG("latitude: %f\r\n", _configLocation.latitude);
  DEBUGLOG("longitude: %f\r\n", _configLocation.longitude);

  return true;
}

bool load_config_network()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!file)
  {
    DEBUGLOG("Failed to open config file\r\n");
    file.close();
    return false;
  }

  // size_t size = file.size();
  DEBUGLOG("JSON file size: %d bytes\r\n", file.size());

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);

  file.close();

  if (!root.success())
  {
    DEBUGLOG("Failed to parse config NETWORK file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGLOG("\r\n");
#endif

  // strlcpy(_config.hostname, root[FPSTR(pgm_hostname)], sizeof(_config.hostname));
  strlcpy(_config.ssid, root[FPSTR(pgm_ssid)], sizeof(_config.ssid));
  strlcpy(_config.password, root[FPSTR(pgm_password)], sizeof(_config.password));
  _config.dhcp = root[FPSTR(pgm_dhcp)];
  strlcpy(_config.static_ip, root[FPSTR(pgm_static_ip)], sizeof(_config.static_ip));
  strlcpy(_config.netmask, root[FPSTR(pgm_netmask)], sizeof(_config.netmask));
  strlcpy(_config.gateway, root[FPSTR(pgm_gateway)], sizeof(_config.gateway));
  strlcpy(_config.dns0, root[FPSTR(pgm_dns0)], sizeof(_config.dns0));
  strlcpy(_config.dns1, root[FPSTR(pgm_dns1)], sizeof(_config.dns1));

  DEBUGLOG("\r\nNetwork settings loaded successfully.\r\n");
  DEBUGLOG("hostname: %s\r\n", _config.hostname);
  DEBUGLOG("ssid: %s\r\n", _config.ssid);
  DEBUGLOG("pass: %s\r\n", _config.password);
  DEBUGLOG("dhcp: %d\r\n", _config.dhcp);
  DEBUGLOG("static_ip: %s\r\n", _config.static_ip);
  DEBUGLOG("netmask: %s\r\n", _config.netmask);
  DEBUGLOG("gateway: %s\r\n", _config.gateway);
  DEBUGLOG("dns0: %s\r\n", _config.dns0);
  DEBUGLOG("dns1: %s\r\n", _config.dns1);

  return true;
}

bool load_config_time()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfiletime), "r");
  if (!file)
  {
    DEBUGLOG("Failed to open config TIME file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGLOG("config TIME file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size + 1];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGLOG("Failed to parse config TIME file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGLOG("\r\n");

#endif

  _configTime.dst = root[FPSTR(pgm_dst)];
  _configTime.enablertc = root[FPSTR(pgm_enablertc)];
  _configTime.enablentp = root[FPSTR(pgm_enablentp)];
  strlcpy(_configTime.ntpserver_0, root[FPSTR(pgm_ntpserver_0)], sizeof(_configTime.ntpserver_0));
  strlcpy(_configTime.ntpserver_1, root[FPSTR(pgm_ntpserver_1)], sizeof(_configTime.ntpserver_1));
  strlcpy(_configTime.ntpserver_2, root[FPSTR(pgm_ntpserver_2)], sizeof(_configTime.ntpserver_2));
  _configTime.syncinterval = root[FPSTR(pgm_syncinterval)];
  _configTime.lastsync = root[FPSTR(pgm_lastsync)];

  //check
  DEBUGLOG("Time settings loaded successfully.\r\n");
  DEBUGLOG("dst: %d\r\n", _configTime.dst);
  DEBUGLOG("syncinterval: %d\r\n", _configTime.syncinterval);
  DEBUGLOG("lastsync: %d\r\n", _configTime.lastsync);
  DEBUGLOG("enablertc: %d\r\n", _configTime.enablertc);
  DEBUGLOG("enablentp: %d\r\n", _configTime.enablentp);
  DEBUGLOG("ntpserver_0: %s\r\n", _configTime.ntpserver_0);
  DEBUGLOG("ntpserver_1: %s\r\n", _configTime.ntpserver_1);
  DEBUGLOG("ntpserver_2: %s\r\n", _configTime.ntpserver_2);

