minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  return true;
}

//*************************
// LOAD SHOLAT CONFIG
//*************************
bool load_config_sholat()
{
  DEBUGLOG("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "r");
  if (!file)
  {
    DEBUGLOG("Failed to open config file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGLOG("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size + 1];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGLOG("Failed to parse config file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGLOG("\r\n");

#endif

  //strlcpy(_sholatConfig.location, _config.city, sizeof(_sholatConfig.location));
  //const char *city = _config.city;
  //_sholatConfig.city = city;
  // _sholatConfig.timezone = _configLocation.timezone;
  // _sholatConfig.latitude = _configLocation.latitude;
  // _sholatConfig.longitude = _configLocation.longitude;

  uint8_t len;

  const char *calcMethod = root[FPSTR(pgm_calcMethod)];
  len = strlen(calcMethod);
  if (strncmp_P(calcMethod, pgm_Jafari, len) == 0)
  {
    _sholatConfig.calcMethod = Jafari;
  }
  else if (strncmp_P(calcMethod, pgm_Karachi, len) == 0)
  {
    _sholatConfig.calcMethod = Karachi;
  }
  else if (strncmp_P(calcMethod, pgm_ISNA, len) == 0)
  {
    _sholatConfig.calcMethod = ISNA;
  }
  else if (strncmp_P(calcMethod, pgm_MWL, len) == 0)
  {
    _sholatConfig.calcMethod = MWL;
  }
  else if (strncmp_P(calcMethod, pgm_Makkah, len) == 0)
  {
    _sholatConfig.calcMethod = Makkah;
  }
  else if (strncmp_P(calcMethod, pgm_Egypt, len) == 0)
  {
    _sholatConfig.calcMethod = Egypt;
  }
  else if (strncmp_P(calcMethod, pgm_Custom, len) == 0)
  {
    _sholatConfig.calcMethod = Custom;
  }

  //asrMethod
  const char *asrJuristic = root[FPSTR(pgm_asrJuristic)];
  len = strlen(asrJuristic);
  if (strncmp_P(asrJuristic, pgm_Shafii, len) == 0)
  {
    _sholatConfig.asrJuristic = Shafii;
  }
  else if (strncmp_P(asrJuristic, pgm_Hanafi, len) == 0)
  {
    _sholatConfig.asrJuristic = Hanafi;
  }

  // highLatsAdjustMethod
  const char *highLatsAdjustMethod = root[FPSTR(pgm_highLatsAdjustMethod)];
  len = strlen(highLatsAdjustMethod);
  if (strncmp_P(highLatsAdjustMethod, pgm_None, len) == 0)
  {
    _sholatConfig.highLatsAdjustMethod = None;
  }
  else if (strncmp_P(highLatsAdjustMethod, pgm_MidNight, len) == 0)
  {
    _sholatConfig.highLatsAdjustMethod = MidNight;
  }
  else if (strncmp_P(highLatsAdjustMethod, pgm_OneSeventh, len) == 0)
  {
    _sholatConfig.highLatsAdjustMethod = OneSeventh;
  }
  else if (strncmp_P(highLatsAdjustMethod, pgm_AngleBased, len) == 0)
  {
    _sholatConfig.highLatsAdjustMethod = AngleBased;
  }

  _sholatConfig.fajrAngle = root[FPSTR(pgm_fajrAngle)].as<uint16_t>();
  _sholatConfig.maghribAngle = root[FPSTR(pgm_maghribAngle)].as<uint16_t>();
  _sholatConfig.ishaAngle = root[FPSTR(pgm_ishaAngle)].as<uint16_t>();
  _sholatConfig.offsetImsak = root[FPSTR(pgm_offsetImsak)].as<float>();
  _sholatConfig.offsetFajr = root[FPSTR(pgm_offsetFajr)].as<float>();
  _sholatConfig.offsetSunrise = root[FPSTR(pgm_offsetSunrise)].as<float>();
  _sholatConfig.offsetDhuhr = root[FPSTR(pgm_offsetDhuhr)].as<float>();
  _sholatConfig.offsetAsr = root[FPSTR(pgm_offsetAsr)].as<float>();
  _sholatConfig.offsetSunset = root[FPSTR(pgm_offsetSunset)].as<float>();
  _sholatConfig.offsetMaghrib = root[FPSTR(pgm_offsetMaghrib)].as<float>();
  _sholatConfig.offsetIsha = root[FPSTR(pgm_offsetIsha)].as<float>();

  //check
  DEBUGLOG("\r\nSholat settings loaded successfully.\r\n");
  //DEBUGLOG("location: %s\r\n", _sholatConfig.location);
  // DEBUGLOG("timezone: %d\r\n", TimezoneFloat());
  DEBUGLOG("timezonestring: %s\r\n", _configLocation.timezonestring);
  DEBUGLOG("latitude: %f\r\n", _configLocation.latitude);
  DEBUGLOG("longitude: %f\r\n", _configLocation.longitude);
  DEBUGLOG("calcMethod: %d\r\n", _sholatConfig.calcMethod);
  DEBUGLOG("asrJuristic: %d\r\n", _sholatConfig.asrJuristic);
  DEBUGLOG("highLatsAdjustMethod: %d\r\n", _sholatConfig.highLatsAdjustMethod);
  DEBUGLOG("fajrAngle: %d\r\n", _sholatConfig.fajrAngle);
  DEBUGLOG("maghribAngle: %d\r\n", _sholatConfig.maghribAngle);
  DEBUGLOG("ishaAngle: %d\r\n", _sholatConfig.ishaAngle);
  DEBUGLOG("offsetImsak: %.1f\r\n", _sholatConfig.offsetImsak);
  DEBUGLOG("offsetFajr: %.1f\r\n", _sholatConfig.offsetFajr);
  DEBUGLOG("offsetSunrise: %.1f\r\n", _sholatConfig.offsetSunrise);
  DEBUGLOG("offsetDhuhr: %.1f\r\n", _sholatConfig.offsetDhuhr);
  DEBUGLOG("offsetAsr: %.1f\r\n", _sholatConfig.offsetAsr);
  DEBUGLOG("offsetSunset: %.1f\r\n", _sholatConfig.offsetSunset);
  DEBUGLOG("offsetMaghrib: %.1f\r\n", _sholatConfig.offsetMaghrib);
  DEBUGLOG("offsetIsha: %.1f\r\n", _sholatConfig.offsetIsha);

  return true;
}

//*************************
// LOAD CONFIG LEDMATRIX
//*************************
bool load_config_ledmatrix()
{
  DEBUGLOG("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "r");
  if (!file)
  {
    DEBUGLOG("Failed to open config LEDMATRIX file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGLOG("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size + 1];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGLOG("Failed to parse config LEDMATRIX file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGLOG("\r\n");

#endif

  uint8_t op = root[FPSTR(pgm_operatingmode)];

