minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  endPos = file.position();
  // buf[offset + 1] = '\0';
  PRINT("X: %5d, wFirstChar: %d, offset: %4d, startPos: %3d, endPos: %3d, string: %s\r\n", X, wFirstChar, offset, startPos, endPos, buf);

  offset = -1;
  matrix.print(buf);

  // if (offset > 10)
  // {

  //   offset = -1;
  // }

  // for (int i = 0; i < numberOfChunks; i++)
  // {
  // }

  // file.seek(offset, mode);
  // while (file.available())
  // {
  //   file.read();
  //   Serial.println(file.position());
  // }

  /*
  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    file.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }
  */

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  file.close();

  //contents = "";
  //return contents;

  //return F("success");
}

void load_running_text_2()
{
  const char *fileName = pgm_RUNNING_TEXT_FILE_2;

  File runningTextFile = SPIFFS.open(fileName, "r");
  if (!runningTextFile)
  {
    DEBUGLOG("Failed to open %s file\r\n", fileName);
    //return F("failed");
    //    return false;
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  int fileSize = runningTextFile.size();
  //Serial.println(fileSize);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  char buf[chunkSize];
  int numberOfChunks = (fileSize / chunkSize) + 1;

  // int count = 0;
  int remainingChunks = fileSize;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  wText = 0;

  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    runningTextFile.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  runningTextFile.close();

  //contents = "";
  //return contents;

  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  //return F("success");
}

char *formatBytes(size_t bytes)
{
  static char buf[10];
  if (bytes < 1024)
  {
    itoa(bytes, buf, 10);
    strcat(buf, "B");
  }
  else if (bytes < (1024 * 1024))
  {
    itoa(bytes / 1024.0, buf, 10);
    strcat(buf, "KB");
  }
  else if (bytes < (1024 * 1024 * 1024))
  {
    itoa(bytes / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "MB");
  }
  else
  {
    itoa(bytes / 1024.0 / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "GB");
  }
  return buf;
}

bool loadHTTPAuth()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  const char *fileName = pgm_SECRET_FILE;
  
  File configFile = SPIFFS.open(fileName, "r");
  if (!configFile)
  {
    DEBUGLOG("Failed to open %s file\r\n", fileName);
    _httpAuth.auth = false;
    _httpAuth.wwwUsername[0] = '\0';
    _httpAuth.wwwPassword[0] = '\0';
    configFile.close();
    return false;
  }

  size_t size = configFile.size();

  // Allocate a buffer to store contents of the file.
  std::unique_ptr<char[]> buf(new char[size]);

  // We don't use String here because ArduinoJson library requires the input
  // buffer to be mutable. If you don't use ArduinoJson, you may as well
  // use configFile.readString instead.
  configFile.readBytes(buf.get(), size);
  configFile.close();
  DEBUGLOG("JSON secret file size: %d bytes\r\n", size);
  DynamicJsonBuffer jsonBuffer;
  //StaticJsonBuffer<256> jsonBuffer;
  JsonObject &json = jsonBuffer.parseObject(buf.get());

  if (!json.success())
  {
#ifndef RELEASE
    //String temp;
    json.prettyPrintTo(DEBUGPORT);
    PRINT("\r\n");
    PRINT("Failed to parse secret file\r\n");
#endif // RELEASE
    _httpAuth.auth = false;
    return false;
  }
#ifndef RELEASE
  //String temp;
  json.prettyPrintTo(DEBUGPORT);
  PRINT("\r\n");
#endif // RELEASE

  _httpAuth.auth = json["auth"];
  strlcpy(_httpAuth.wwwUsername, json["user"], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, json["pass"], sizeof(_httpAuth.wwwPassword));

  if (_httpAuth.auth)
  {
    DEBUGLOG("User: %s\r\n", _httpAuth.wwwUsername);
    DEBUGLOG("Pass: %s\r\n", _httpAuth.wwwPassword);
  }

  return true;
}

void AsyncWSLoop()
{
  ArduinoOTA.handle();
  dnsServer.processNextRequest();

  // static time_t oldTime = localTime;
  //if (localTime != oldTime) {
  if (tick1000ms)
  {
    // send SSE if SSE client available
    // if (events.count())
    // {
    //   sendSholatSchedule(1);

    //   PRINT("\r\nNum of sse client: %d\r\n", events.count());
    // }

    if (firmwareUpdated)
    { // check the flag here to determine if a restart is required
      PRINT("Restarting ESP\r\n");
      firmwareUpdated = false;
      ESP.restart();
    }

    static char ssid_old[sizeof(_config.ssid)];
    static char password_old[sizeof(_config.password)];
    static bool dhcp_old;
    static char static_ip_old[sizeof(_config.static_ip)];
    static char netmask_old[sizeof(_config.netmask)];
    static char gateway_old[sizeof(_config.gateway)];
    static char dns0_old[sizeof(_config.dns0)];
    static char dns1_old[sizeof(_config.dns1)];

