minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
    static bool doOnce = true;
    if (doOnce)
    {
      doOnce = false;
      strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
      strlcpy(password_old, _config.password, sizeof(password_old));
      dhcp_old = _config.dhcp;
      strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
      strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
      strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
      strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
      strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));
    }

    if (configFileNetworkUpdatedFlag)
    {
      configFileNetworkUpdatedFlag = false;

      if (strcmp(ssid_old, _config.ssid) != 0 ||
          strcmp(password_old, _config.password) != 0 ||
          dhcp_old != _config.dhcp ||
          strcmp(static_ip_old, _config.static_ip) != 0 ||
          strcmp(netmask_old, _config.netmask) != 0 ||
          strcmp(gateway_old, _config.gateway) != 0 ||
          strcmp(dns0_old, _config.dns0) != 0 ||
          strcmp(dns1_old, _config.dns1) != 0)
      {

        PRINT("\r\n*** Network Settings Updated ***\r\nApllying new settings...\r\n\r\n");

        // update old values
        strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
        strlcpy(password_old, _config.password, sizeof(password_old));
        dhcp_old = _config.dhcp;
        strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
        strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
        strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
        strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
        strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));

        if (!_config.dhcp)
        {
          PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
          WiFi.mode(WIFI_OFF);
          WiFi.mode(WIFI_STA);

          IPAddress static_ip;
          IPAddress gateway;
          IPAddress netmask;
          IPAddress dns0;
          IPAddress dns1;

          static_ip.fromString(_config.static_ip);
          gateway.fromString(_config.gateway);
          netmask.fromString(_config.netmask);
          dns0.fromString(_config.dns0);
          dns1.fromString(_config.dns1);

          WiFi.config(static_ip, gateway, netmask, dns0, dns1);
          WiFi.hostname(_config.hostname);
          WiFi.begin(_config.ssid, _config.password);
          // WiFi.waitForConnectResult();
        }
        else
        {
          if (_config.ssid)
          {
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }
      else
      {
        if (WiFi.status() != WL_CONNECTED)
        {
          if (_config.ssid)
          {
            PRINT("\r\nApllying new NETWORK settings...\r\n\r\n");
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }

      //beep
      tone1 = HIGH;
    }
  }

  if (tick3000ms)
  {
  }

  if (wifiGotIpFlag)
  {
    wifiGotIpFlag = false;

    WiFi.setAutoConnect(autoConnect);
    WiFi.setAutoReconnect(autoReconnect);

    uint8_t mode = WiFi.getMode();
    if (mode == WIFI_AP)
    {
      // const char* mode_string = PSTR(pgm_WIFI_AP);
      PRINT("\r\nWifi mode: WIFI_AP\r\n");
    }
    else if (mode == WIFI_STA)
    {
      PRINT("\r\nWifi mode: WIFI_STA\r\n");

      // PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      // WiFi.softAPdisconnect(true);
    }
    else if (mode == WIFI_AP_STA)
    {
      PRINT("\r\nWifi mode: WIFI_AP_STA\r\n");

      PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      // WiFi.softAPdisconnect(true);

      WiFi.mode(WIFI_OFF);

      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
    }
    else if (mode == WIFI_OFF)
    {
      PRINT("\r\nWifi mode: WIFI_OFF\r\n");
    }
    else
    {
      PRINT("\r\nWifi mode: UNKNOWN\r\n");
    }

    /*
    https://github.com/esp8266/Arduino/blob/4897e0006b5b0123a2fa31f67b14a3fff65ce561/libraries/ESP8266WiFi/src/include/wl_definitions.h

    typedef enum {
    WL_NO_SHIELD        = 255,   // for compatibility with WiFi Shield library
    WL_IDLE_STATUS      = 0,
    WL_NO_SSID_AVAIL    = 1,
    WL_SCAN_COMPLETED   = 2,
    WL_CONNECTED        = 3,
    WL_CONNECT_FAILED   = 4,
    WL_CONNECTION_LOST  = 5,
    WL_DISCONNECTED     = 6
    } wl_status_t;
  */
  }

  if (wifiDisconnectedFlag)
  {
    wifiDisconnectedFlag = false;

    // WiFi.reconnect();
    uint8_t client = WiFi.softAPgetStationNum();

    // Serial.printf("\r\nStations connected to soft-AP = %d\r\n", client);

    if (!client)
    {
      // set hostname before reconnect
      // WiFi.hostname(_config.hostname);
      // WiFi.begin(_config.ssid, _config.password);

      WiFi.reconnect();

      PRINT("\r\nStations connected to soft-AP = %d, start WiFi.reconnect()\r\n", client);
    }
    else
    {
      PRINT("\r\nStations connected to soft-AP = %d, CANNOT START WiFi.reconnect()\r\n", client);
    }

    static bool apEnable = false;

    PRINT("\r\n*** apEnable = %d ***\r\n", apEnable);

    if (wifiDisconnectedSince == 0)
    {
      wifiDisconnectedSince = millis();
      apEnable = true;
    }

    PRINT("*** apEnable = %d ***\r\n", apEnable);

    if (apEnable == true && (int)((millis() - wifiDisconnectedSince) / 1000) >= 15)
    {
      PRINT("\r\n*** Starting Wifi Access Point... ***\r\n");

      apEnable = false;
      WiFi.mode(WIFI_OFF);
      // WiFi.mode(WIFI_AP_STA);
      // WiFi.softAP(_configAP.ssid, _configAP.password);
      WiFi.softAP(_configAP.ssid, _configAP.password);
      // WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));

      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      // WiFi.begin(_config.ssid, _config.password, 11);
    }

    // PRINT("\r\nWifi disconnected for %d seconds\r\n", (int)((millis() - wifiDisconnectedSince) / 1000);
    DEBUGPORT.printf_P(PSTR("\r\nWifi disconnected for %d seconds\r\n"), (int)((millis() - wifiDisconnectedSince) / 1000));
  }

  if (stationConnectedFlag)
  {
    stationConnectedFlag = false;
  }

  if (stationDisconnectedFlag)
  {
    stationDisconnectedFlag = false;
    uint8_t client = WiFi.softAPgetStationNum();

    if (!client)
    {
      WiFi.reconnect();
    }
  }
}

int pgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

bool save_system_info()
{
  PRINT("%s\r\n", __PRETTY_FUNCTION__);

  // const char* pathtofile = PSTR(pgm_filesystemoverview);

  const char* fileName = pgm_systeminfofile;

